app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'
---
  def find
    if params[:title]!=nil
      @movie=Movie.find(params[:title])
      if(@movie!=nil) && (!@movie.director.empty?)